// Одностройчный комментарий

/*
Многострочный комментарий
*/

/**
 * JSDoc комментарий
 */

/**
 * Типы данных:
 * Примитивные:
 *  - Number (и целые, и дробные, NaN, Infinity)
 *  - String ('fgh, "rtyu", `cvbn`)
 *  - Boolean
 *  - NuLL
 *  - Undefined
 *  - Symbol()
 * 
 * Ссылочные:
 *  Объекты { index: value}
 *   - Object
 *      * Array
 *      * Function
 *      * Date
 *      * ...
 * 
 * Особенности:
 * JS динамически типизирован
 * Одна и та же переменная хранит в себе любой тип данных
 * Не нужно определять тип данных при заведении переменных
 * TypeScript и Flow требуют статическую типизацию
 */

// Объявление переменных
// var, Let, const
// var можно несколько раз определить, а let позволяет работать с переменными так, чтобы используемое имя задавалось только один раз