console.log(Math.round(Math.PI * 100) / 100);

console.log(Math.max(15, 11, 16, 12, 51, 12, 13, 51));

var value;
value = Math.round((Math.random() * 100)) / 100
console.log(value)

var value2;
value2 = Math.round(Math.random() * 15)
console.log(value2)

var value3;
value3 = 0.6 + 0.7;
console.log(value3.toFixed(1));

console.log(parseInt('100$'));


// Вопросы к этому заданию
// Получить число pi из Math и округлить его до 2-х знаков после точки



// Используя Math, найти максимальное и минимальное числа из представленного ряда 15, 11, 16, 12, 51, 12, 13, 51

// Работа с Math.random:

// a. Получить случайное число и округлить его до двух цифр после запятой

// b. Получить случайное целое число от 0 до X. X - любое произвольное число.



// Проверить результат вычисления 0.6 + 0.7 - как привести к нормальному виду (1.3)?

// Получить число из строки ‘100$’